In [2]:
import pandas as pd
import numpy as np

In [59]:
from ast import Assign
from operator import concat


dados = pd.read_csv('binary.csv', sep=',')
df1 = pd.DataFrame(dados)
#df2 = df1.set_index('cod')


c1 = np.arange(0,5,1)
c2 = np.random.rand(5)
df2 = pd.DataFrame(zip(c1,c2), columns=['teste1','teste2'])

display(df1,df2)

   cod  admit  gre   gpa  rank
0    1      0  380  3.61     3
1    2      1  660  3.67     3
2    3      1  880  4.00     1
3    4      1  640  3.19     4
4    5      0  520  2.93     4

   teste1    teste2
0       0  0.598749
1       1  0.898084
2       2  0.939539
3       3  0.913740
4       4  0.614085

In [60]:
df3 = pd.concat([df1,df2], ignore_index=True)
df4 = pd.concat([df1,df2], keys=['tab1','tab2'])
display(df3,df4)

   cod  admit    gre   gpa  rank  teste1    teste2
0  1.0    0.0  380.0  3.61   3.0     NaN       NaN
1  2.0    1.0  660.0  3.67   3.0     NaN       NaN
2  3.0    1.0  880.0  4.00   1.0     NaN       NaN
3  4.0    1.0  640.0  3.19   4.0     NaN       NaN
4  5.0    0.0  520.0  2.93   4.0     NaN       NaN
5  NaN    NaN    NaN   NaN   NaN     0.0  0.598749
6  NaN    NaN    NaN   NaN   NaN     1.0  0.898084
7  NaN    NaN    NaN   NaN   NaN     2.0  0.939539
8  NaN    NaN    NaN   NaN   NaN     3.0  0.913740
9  NaN    NaN    NaN   NaN   NaN     4.0  0.614085

        cod  admit    gre   gpa  rank  teste1    teste2
tab1 0  1.0    0.0  380.0  3.61   3.0     NaN       NaN
     1  2.0    1.0  660.0  3.67   3.0     NaN       NaN
     2  3.0    1.0  880.0  4.00   1.0     NaN       NaN
     3  4.0    1.0  640.0  3.19   4.0     NaN       NaN
     4  5.0    0.0  520.0  2.93   4.0     NaN       NaN
tab2 0  NaN    NaN    NaN   NaN   NaN     0.0  0.598749
     1  NaN    NaN    NaN   NaN   NaN     1.0  0.898084
     2  NaN    NaN    NaN   NaN   NaN     2.0  0.939539
     3  NaN    NaN    NaN   NaN   NaN     3.0  0.913740
     4  NaN    NaN    NaN   NaN   NaN     4.0  0.614085

In [72]:
df5 = pd.concat([df1,df2], keys=['tab1','tab2'], axis=1)
display(df5)

  tab1                         tab2
   cod admit  gre   gpa rank teste1    teste2
0    1     0  380  3.61    3      0  0.598749
1    2     1  660  3.67    3      1  0.898084
2    3     1  880  4.00    1      2  0.939539
3    4     1  640  3.19    4      3  0.913740
4    5     0  520  2.93    4      4  0.614085